AccumulationRegisters/ОстаткиАбонементов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>ОстаткиАбонементов</Name>
    <RegisterType>Balance</RegisterType>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Dimension>
      <Name>АбонементКлиента</Name>
      <ValueType><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type></v8:TypeQualifiers></ValueType>
    </Dimension>

    <Dimension>
      <Name>Клиент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
    </Dimension>

    <Resource>
      <Name>КоличествоЗанятий</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Resource>

  </ChildObjects>
</MetaDataObject>

Enums/СтатусыАбонементаКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыАбонементаКлиента</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Активен</Name>
    </Value>
    <Value>
      <Name>Заморожен</Name>
    </Value>
    <Value>
      <Name>Закончился</Name>
    </Value>
    <Value>
      <Name>Истёк</Name>
    </Value>
    <Value>
      <Name>Отменён</Name>
    </Value>
  </Properties>
</MetaDataObject>

Catalogs/АбонементыКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>АбонементыКлиента</Name>
    <Hierarchical>false</Hierarchical>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>Клиент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВидАбонемента</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Абонементы</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Абонементы</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаПокупки</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаНачалаДействия</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаОкончания</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>КоличествоЗанятий</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Использовано</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Заморожено</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>10</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Статус</Name>
      <ValueType><v8:Type>cfg:EnumRef.СтатусыАбонементаКлиента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыАбонементаКлиента</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ПроданоПоДокументу</Name>
      <ValueType><v8:Type>cfg:DocumentRef.ПродажаАбонемента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:DocumentRef.ПродажаАбонемента</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

CommonModules/РаботаСОстаткамиАбонементов/Ext/Module.bsl
// Расчёт остатков занятий по абонементам клиента.
// Источник истины по остаткам - регистр накопления ОстаткиАбонементов.
// Справочное значение Использовано в АбонементыКлиента - денормализация для удобства отображения.

// Остаток по регистру = Приход (зачислено) - Расход (списано)
Функция ОстатокЗанятийПоАбонементу(АбонементКлиента) Экспорт
	Если ПустоеЗначение(АбонементКлиента) Тогда
		Возврат 0;
	КонецЕсли;
	НаборЗаписей = РегистрыНакопления.ОстаткиАбонементов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.АбонементКлиента.Установить(АбонементКлиента);
	ТЗ = РегистрыНакопления.ОстаткиАбонементов.Остатки(НаборЗаписей.Отбор,);
	Сумма = 0;
	Для Каждого Строка ИЗ ТЗ Цикл
		Сумма = Сумма + Строка.КоличествоЗанятийОстаток;
	КонецЦикла;
	Возврат Сумма;
КонецФункции

// Движения по регистру для абонемента клиента
Процедура ЗаписатьДвиженияОстатки(ДокументСсылка, Период, КолДанных) Экспорт
	НаборЗаписей = РегистрыНакопления.ОстаткиАбонементов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
	НаборЗаписей.Записать();

	Для Каждого ДвижениеДанных ИЗ КолДанных Цикл
		Движение = НаборЗаписей.Добавить();
		Движение.ВидДвижения = ДвижениеДанных.ВидДвижения;
		Движение.Период = Период;
		Движение.АбонементКлиента = ДвижениеДанных.АбонементКлиента;
		Движение.Клиент = ДвижениеДанных.АбонементКлиента.Клиент;
		Движение.КоличествоЗанятий = ДвижениеДанных.КоличествоЗанятий;
	КонецЦикла;

	НаборЗаписей.Записать();
КонецПроцедуры

// Обновляет денормализованное поле Использовано по остаткам регистра
Процедура ОбновитьИспользованоПоАбонементу(АбонементКлиента) Экспорт
	Если ПустоеЗначение(АбонементКлиента) Тогда
		Возврат;
	КонецЕсли;
	Элемент = АбонементКлиента.ПолучитьОбъект();
	Остаток = ОстатокЗанятийПоАбонементу(Элемент.Ссылка);
	Элемент.Использовано = Элемент.КоличествоЗанятий - Остаток;
	Если Остаток <= 0 И Элемент.КоличествоЗанятий > 0 Тогда
		Элемент.Статус = Перечисления.СтатусыАбонементаКлиента.Закончился;
	ИначеЕсли Не ПустоеЗначение(Элемент.ДатаОкончания) И Элемент.ДатаОкончания < ТекущаяДата() Тогда
		Если Элемент.Статус <> Перечисления.СтатусыАбонементаКлиента.Заморожен Тогда
			Элемент.Статус = Перечисления.СтатусыАбонементаКлиента.Истёк;
		КонецЕсли;
	ИначеЕсли Элемент.Статус = Перечисления.СтатусыАбонементаКлиента.Закончился
		И Остаток > 0 Тогда
		Элемент.Статус = Перечисления.СтатусыАбонементаКлиента.Активен;
	КонецЕсли;
	Элемент.Записать();
КонецПроцедуры

// Поиск действующего активного абонемента клиента с остатком по регистру > 0
Функция АктивныйАбонементКлиента(Клиент, Направление = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	АбонементыКлиента.Ссылка КАК Ссылка,
		|	Остатки.КоличествоЗанятийОстаток КАК Остаток
		|ИЗ
		|	Справочник.АбонементыКлиента КАК АбонементыКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАбонементов.Остатки(
		|			&Дата,
		|			Клиент = &Клиент
		|				И АбонементКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыАбонементаКлиента.Активен)) КАК Остатки
		|		ПО АбонементыКлиента.Ссылка = Остатки.АбонементКлиента
		|ГДЕ
		|	АбонементыКлиента.Клиент = &Клиент
		|	И АбонементыКлиента.ДатаОкончания >= &Дата
		|	И Остатки.КоличествоЗанятийОстаток > 0
		|	И НЕ АбонементыКлиента.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	АбонементыКлиента.ДатаОкончания";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.АбонементыКлиента.ПустаяСсылка();
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
КонецФункции
